jeffarrow/rtDualMotorCtrl/ICC_QMC_Motor_Control_App/board/boards/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v4.1
processor: MIMXRT1052xxxxx
package_id: MIMXRT1052DVL6A
mcu_data: ksdk2_0
processor_version: 3.0.2
pin_labels:
- {pin_num: M14, pin_signal: GPIO_AD_B0_00, label: PWM2_CT, identifier: PWM2_CT}
- {pin_num: H10, pin_signal: GPIO_AD_B0_01, label: PWM2_CB, identifier: PWM2_CB}
- {pin_num: M11, pin_signal: GPIO_AD_B0_02, label: SERIAL_TX, identifier: SERIAL_TX}
- {pin_num: G11, pin_signal: GPIO_AD_B0_03, label: SERIAL_RX, identifier: SERIAL_RX}
- {pin_num: F11, pin_signal: GPIO_AD_B0_04, label: USER_BUTTON1, identifier: USER_BUTTON1}
- {pin_num: G14, pin_signal: GPIO_AD_B0_05, label: USER_BUTTON2, identifier: USER_BUTTON2}
- {pin_num: E14, pin_signal: GPIO_AD_B0_06, label: SWD_DIO, identifier: SWD_DIO}
- {pin_num: F12, pin_signal: GPIO_AD_B0_07, label: SWD_CLK, identifier: SWD_CLK}
- {pin_num: F13, pin_signal: GPIO_AD_B0_08, label: LCD_BACKLIGHT_CTRL, identifier: LCD_BACKLIGHT_CTRL}
- {pin_num: F14, pin_signal: GPIO_AD_B0_09, label: ENET_RST, identifier: ENET_RST}
- {pin_num: G13, pin_signal: GPIO_AD_B0_10, label: ENET_INT, identifier: ENET_INT}
- {pin_num: G10, pin_signal: GPIO_AD_B0_11, label: LCD_TOUCH_INT, identifier: LCD_TOUCH_INT}
- {pin_num: K14, pin_signal: GPIO_AD_B0_12, label: CURR1_DCB, identifier: CURR1_DCB}
- {pin_num: L14, pin_signal: GPIO_AD_B0_13, label: VOLT1_DCB, identifier: VOLT1_DCB}
- {pin_num: H14, pin_signal: GPIO_AD_B0_14, label: CURR2_DCB, identifier: CURR2_DCB}
- {pin_num: L10, pin_signal: GPIO_AD_B0_15, label: VOLT2_DCB, identifier: VOLT2_DCB}
- {pin_num: J11, pin_signal: GPIO_AD_B1_00, label: CURR1_A, identifier: CURR1_A}
- {pin_num: K11, pin_signal: GPIO_AD_B1_01, label: CURR1_B, identifier: CURR1_B}
- {pin_num: L11, pin_signal: GPIO_AD_B1_02, label: CURR1_C, identifier: CURR1_C}
- {pin_num: M12, pin_signal: GPIO_AD_B1_03, label: CURR2_A, identifier: CURR2_A}
- {pin_num: L12, pin_signal: GPIO_AD_B1_04, label: CURR2_B, identifier: CURR2_B}
- {pin_num: K12, pin_signal: GPIO_AD_B1_05, label: CURR2_C, identifier: CURR2_C}
- {pin_num: J12, pin_signal: GPIO_AD_B1_06, label: CURR3_A, identifier: CURR3_A}
- {pin_num: K10, pin_signal: GPIO_AD_B1_07, label: CURR3_B, identifier: CURR3_B}
- {pin_num: H13, pin_signal: GPIO_AD_B1_08, label: CURR3_C, identifier: CURR3_C}
- {pin_num: M13, pin_signal: GPIO_AD_B1_09, label: CURR4_A, identifier: CURR4_A}
- {pin_num: L13, pin_signal: GPIO_AD_B1_10, label: CURR4_B, identifier: CURR4_B}
- {pin_num: J13, pin_signal: GPIO_AD_B1_11, label: CURR4_C, identifier: CURR4_C}
- {pin_num: H12, pin_signal: GPIO_AD_B1_12, label: CURR3_DCB, identifier: CURR3_DCB}
- {pin_num: H11, pin_signal: GPIO_AD_B1_13, label: VOLT3_DCB, identifier: VOLT3_DCB}
- {pin_num: G12, pin_signal: GPIO_AD_B1_14, label: CURR4_DCB, identifier: CURR4_DCB}
- {pin_num: J14, pin_signal: GPIO_AD_B1_15, label: VOLT4_DCB, identifier: VOLT4_DCB}
- {pin_num: D7, pin_signal: GPIO_B0_00, label: LCDIF_CLK, identifier: LCDIF_CLK}
- {pin_num: E7, pin_signal: GPIO_B0_01, label: LCDIF_ENABLE, identifier: LCDIF_ENABLE}
- {pin_num: E8, pin_signal: GPIO_B0_02, label: LCDIF_HSYNC, identifier: LCDIF_HSYNC}
- {pin_num: D8, pin_signal: GPIO_B0_03, label: LCDIF_VSYNC, identifier: LCDIF_VSYNC}
- {pin_num: C8, pin_signal: GPIO_B0_04, label: LCDIF_DATA00, identifier: LCDIF_DATA00}
- {pin_num: B8, pin_signal: GPIO_B0_05, label: LCDIF_DATA01, identifier: LCDIF_DATA01}
- {pin_num: A8, pin_signal: GPIO_B0_06, label: LCDIF_DATA02, identifier: LCDIF_DATA02}
- {pin_num: A9, pin_signal: GPIO_B0_07, label: LCDIF_DATA03, identifier: LCDIF_DATA03}
- {pin_num: B9, pin_signal: GPIO_B0_08, label: LCDIF_DATA04, identifier: LCDIF_DATA04}
- {pin_num: C9, pin_signal: GPIO_B0_09, label: LCDIF_DATA05, identifier: LCDIF_DATA05}
- {pin_num: D9, pin_signal: GPIO_B0_10, label: LCDIF_DATA06, identifier: LCDIF_DATA06}
- {pin_num: A10, pin_signal: GPIO_B0_11, label: LCDIF_DATA07, identifier: LCDIF_DATA07}
- {pin_num: C10, pin_signal: GPIO_B0_12, label: PERI_PWDN, identifier: PERI_PWDN}
- {pin_num: D10, pin_signal: GPIO_B0_13, label: USER_LED1, identifier: USER_LED1}
- {pin_num: E10, pin_signal: GPIO_B0_14, label: USER_LED2, identifier: USER_LED2}
- {pin_num: E11, pin_signal: GPIO_B0_15, label: ENC2_I, identifier: ENC2_I}
- {pin_num: A11, pin_signal: GPIO_B1_00, label: ENC3_I, identifier: ENC3_I}
- {pin_num: B11, pin_signal: GPIO_B1_01, label: ENC4_A, identifier: ENC4_A}
- {pin_num: C11, pin_signal: GPIO_B1_02, label: ENC4_B, identifier: ENC4_B}
- {pin_num: D11, pin_signal: GPIO_B1_03, label: ENC4_I, identifier: ENC4_I}
- {pin_num: E12, pin_signal: GPIO_B1_04, label: ENET_RX_DATA0, identifier: ENET_RX_DATA0}
- {pin_num: D12, pin_signal: GPIO_B1_05, label: ENET_RX_DATA1, identifier: ENET_RX_DATA1}
- {pin_num: C12, pin_signal: GPIO_B1_06, label: ENET_CRS_RV, identifier: ENET_CRS_RV}
- {pin_num: B12, pin_signal: GPIO_B1_07, label: ENET_TX_DATA0, identifier: ENET_TX_DATA0}
- {pin_num: A12, pin_signal: GPIO_B1_08, label: ENET_TX_DATA1, identifier: ENET_TX_DATA1}
- {pin_num: A13, pin_signal: GPIO_B1_09, label: ENET_TX_EN, identifier: ENET_TX_EN}
- {pin_num: B13, pin_signal: GPIO_B1_10, label: ENET_TX_CLK, identifier: ENET_TX_CLK}
- {pin_num: C13, pin_signal: GPIO_B1_11, label: ENET_RX_ER, identifier: ENET_RX_ER}
- {pin_num: D13, pin_signal: GPIO_B1_12, label: USDHC1_CD_B, identifier: USDHC1_CD_B}
- {pin_num: D14, pin_signal: GPIO_B1_13, label: WDOG1_B, identifier: WDOG1_B}
- {pin_num: C14, pin_signal: GPIO_B1_14, label: ENET_MDC, identifier: ENET_MDC}
- {pin_num: B14, pin_signal: GPIO_B1_15, label: ENET_MDIO, identifier: ENET_MDIO}
- {pin_num: E3, pin_signal: GPIO_EMC_00, label: PWM4_AT, identifier: PWM4_AT}
- {pin_num: F3, pin_signal: GPIO_EMC_01, label: PWM4_AB, identifier: PWM4_AB}
- {pin_num: F4, pin_signal: GPIO_EMC_02, label: PWM4_BT, identifier: PWM4_BT}
- {pin_num: G4, pin_signal: GPIO_EMC_03, label: PWM4_BB, identifier: PWM4_BB}
- {pin_num: F2, pin_signal: GPIO_EMC_04, label: PWM4_CT, identifier: PWM4_CT}
- {pin_num: G5, pin_signal: GPIO_EMC_05, label: PWM4_CB, identifier: PWM4_CB}
- {pin_num: H5, pin_signal: GPIO_EMC_06, label: PWM2_AT, identifier: PWM2_AT}
- {pin_num: H4, pin_signal: GPIO_EMC_07, label: PWM2_AB, identifier: PWM2_AB}
- {pin_num: H3, pin_signal: GPIO_EMC_08, label: PWM2_BT, identifier: PWM2_BT}
- {pin_num: C2, pin_signal: GPIO_EMC_09, label: PWM2_BB, identifier: PWM2_BB}
- {pin_num: G1, pin_signal: GPIO_EMC_10, label: USER_LED3, identifier: USER_LED3}
- {pin_num: G3, pin_signal: GPIO_EMC_11, label: LCD_TOUCH_SDA, identifier: LCD_TOUCH_SDA}
- {pin_num: H1, pin_signal: GPIO_EMC_12, label: LCD_TOUCH_SCL, identifier: LCD_TOUCH_SCL}
- {pin_num: A6, pin_signal: GPIO_EMC_13, label: ENC2_A, identifier: ENC2_A}
- {pin_num: B6, pin_signal: GPIO_EMC_14, label: ENC2_B, identifier: ENC2_B}
- {pin_num: B1, pin_signal: GPIO_EMC_15, label: ENC3_A, identifier: ENC3_A}
- {pin_num: A5, pin_signal: GPIO_EMC_16, label: ENC3_B, identifier: ENC3_B}
- {pin_num: A4, pin_signal: GPIO_EMC_17, label: FLEXCAN1_TX, identifier: FLEXCAN1_TX}
- {pin_num: B2, pin_signal: GPIO_EMC_18, label: FLEXCAN1_RX, identifier: FLEXCAN1_RX}
- {pin_num: B4, pin_signal: GPIO_EMC_19, label: MODBUS_PROFIBUS_TX, identifier: MODBUS_PROFIBUS_TX}
- {pin_num: A3, pin_signal: GPIO_EMC_20, label: MODBUS_PROFIBUS_RX, identifier: MODBUS_PROFIBUS_RX}
- {pin_num: C1, pin_signal: GPIO_EMC_21, label: SECURITY_SDA, identifier: SECURITY_SDA}
- {pin_num: F1, pin_signal: GPIO_EMC_22, label: SECURITY_SCL, identifier: SECURITY_SCL}
- {pin_num: G2, pin_signal: GPIO_EMC_23, label: PWM1_AT, identifier: PWM1_AT}
- {pin_num: D3, pin_signal: GPIO_EMC_24, label: PWM1_AB, identifier: PWM1_AB}
- {pin_num: D2, pin_signal: GPIO_EMC_25, label: PWM1_BT, identifier: PWM1_BT}
- {pin_num: B3, pin_signal: GPIO_EMC_26, label: PWM1_BB, identifier: PWM1_BB}
- {pin_num: A2, pin_signal: GPIO_EMC_27, label: PWM1_CT, identifier: PWM1_CT}
- {pin_num: D1, pin_signal: GPIO_EMC_28, label: PWM1_CB, identifier: PWM1_CB}
- {pin_num: E1, pin_signal: GPIO_EMC_29, label: PWM3_AT, identifier: PWM3_AT}
- {pin_num: C6, pin_signal: GPIO_EMC_30, label: PWM3_AB, identifier: PWM3_AB}
- {pin_num: C5, pin_signal: GPIO_EMC_31, label: PWM3_BT, identifier: PWM3_BT}
- {pin_num: D5, pin_signal: GPIO_EMC_32, label: PWM3_BB, identifier: PWM3_BB}
- {pin_num: C4, pin_signal: GPIO_EMC_33, label: PWM3_CT, identifier: PWM3_CT}
- {pin_num: D4, pin_signal: GPIO_EMC_34, label: PWM3_CB, identifier: PWM3_CB}
- {pin_num: E5, pin_signal: GPIO_EMC_35, label: ENC1_A, identifier: ENC1_A}
- {pin_num: C3, pin_signal: GPIO_EMC_36, label: ENC1_B, identifier: ENC1_B}
- {pin_num: E4, pin_signal: GPIO_EMC_37, label: ENC1_I, identifier: ENC1_I}
- {pin_num: D6, pin_signal: GPIO_EMC_38, label: MODBUS_PROFIBUS_DE, identifier: MODBUS_PROFIBUS_DE}
- {pin_num: B7, pin_signal: GPIO_EMC_39, label: MODBUS_PROFIBUS_RE, identifier: MODBUS_PROFIBUS_RE}
- {pin_num: A7, pin_signal: GPIO_EMC_40, label: LCD_RST, identifier: LCD_RST}
- {pin_num: C7, pin_signal: GPIO_EMC_41, label: USER_LED4, identifier: USER_LED4}
- {pin_num: J4, pin_signal: GPIO_SD_B0_00, label: USDHC1_CMD, identifier: USDHC1_CMD}
- {pin_num: J3, pin_signal: GPIO_SD_B0_01, label: USDHC1_CLK, identifier: USDHC1_CLK}
- {pin_num: J1, pin_signal: GPIO_SD_B0_02, label: USDHC1_DATA0, identifier: USDHC1_DATA0}
- {pin_num: K1, pin_signal: GPIO_SD_B0_03, label: USDHC1_DATA1, identifier: USDHC1_DATA1}
- {pin_num: H2, pin_signal: GPIO_SD_B0_04, label: USDHC1_DATA2, identifier: USDHC1_DATA2}
- {pin_num: J2, pin_signal: GPIO_SD_B0_05, label: USDHC1_DATA3, identifier: USDHC1_DATA3}
- {pin_num: L5, pin_signal: GPIO_SD_B1_00, label: FLEXSPI_B_DATA3, identifier: FLEXSPI_B_DATA3}
- {pin_num: M5, pin_signal: GPIO_SD_B1_01, label: FLEXSPI_B_DATA2, identifier: FLEXSPI_B_DATA2}
- {pin_num: M3, pin_signal: GPIO_SD_B1_02, label: FLEXSPI_B_DATA1, identifier: FLEXSPI_B_DATA1}
- {pin_num: M4, pin_signal: GPIO_SD_B1_03, label: FLEXSPI_B_DATA0, identifier: FLEXSPI_B_DATA0}
- {pin_num: P2, pin_signal: GPIO_SD_B1_04, label: FLEXSPI_B_SCLK, identifier: FLEXSPI_B_SCLK}
- {pin_num: N3, pin_signal: GPIO_SD_B1_05, label: FLEXSPI_B_SS0, identifier: FLEXSPI_B_SS0}
- {pin_num: L3, pin_signal: GPIO_SD_B1_06, label: FLEXSPI_A_SS0, identifier: FLEXSPI_A_SS0}
- {pin_num: L4, pin_signal: GPIO_SD_B1_07, label: FLEXSPI_A_SCLK, identifier: FLEXSPI_A_SCLK}
- {pin_num: P3, pin_signal: GPIO_SD_B1_08, label: FLEXSPI_A_DATA0, identifier: FLEXSPI_A_DATA0}
- {pin_num: N4, pin_signal: GPIO_SD_B1_09, label: FLEXSPI_A_DATA1, identifier: FLEXSPI_A_DATA1}
- {pin_num: P4, pin_signal: GPIO_SD_B1_10, label: FLEXSPI_A_DATA2, identifier: FLEXSPI_A_DATA2}
- {pin_num: P5, pin_signal: GPIO_SD_B1_11, label: FLEXSPI_A_DATA3, identifier: FLEXSPI_A_DATA3}
- {pin_num: L7, pin_signal: PMIC_STBY_REQ, label: PERI_PWR_ENABLE, identifier: PERI_PWR_ENABLE}
- {pin_num: K7, pin_signal: PMIC_ON_REQ, label: PMIC_ON_REQ, identifier: PMIC_ON_REQ}
- {pin_num: L6, pin_signal: WAKEUP, label: WAKEUP, identifier: WAKEUP}
power_domains: {NVCC_EMC: '3.3', NVCC_GPIO: '3.3', VDD_SOC_IN: '1.25', NVCC_SD0: '3.3', DCDC_PSWITCH: '3.3', VDD_SNVS_IN: '3.3', VDD_USB_CAP: '5.0', DCDC_IN: '3.3',
  NVCC_SD1: '1.8', VDD_SNVS_CAP: '3.3', VDDA_ADC_3P3: '3.3', VDD_HIGH_CAP: '3.3', NVCC_PLL: '3.3', VDD_HIGH_IN: '3.3'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_xbara.h"
#include "fsl_iomuxc.h"
#include "pin_mux.h"

