jeffarrow/rtDualMotorCtrl/ICC_QMC_Motor_Control_App/board/boards/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPwmPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: G2, peripheral: PWM1, signal: 'A, 0', pin_signal: GPIO_EMC_23}
  - {pin_num: D3, peripheral: PWM1, signal: 'B, 0', pin_signal: GPIO_EMC_24}
  - {pin_num: D2, peripheral: PWM1, signal: 'A, 1', pin_signal: GPIO_EMC_25}
  - {pin_num: B3, peripheral: PWM1, signal: 'B, 1', pin_signal: GPIO_EMC_26}
  - {pin_num: A2, peripheral: PWM1, signal: 'A, 2', pin_signal: GPIO_EMC_27}
  - {pin_num: D1, peripheral: PWM1, signal: 'B, 2', pin_signal: GPIO_EMC_28}
  - {pin_num: H5, peripheral: PWM2, signal: 'A, 0', pin_signal: GPIO_EMC_06}
  - {pin_num: H4, peripheral: PWM2, signal: 'B, 0', pin_signal: GPIO_EMC_07}
  - {pin_num: H3, peripheral: PWM2, signal: 'A, 1', pin_signal: GPIO_EMC_08}
  - {pin_num: C2, peripheral: PWM2, signal: 'B, 1', pin_signal: GPIO_EMC_09}
  - {pin_num: M14, peripheral: PWM2, signal: 'A, 3', pin_signal: GPIO_AD_B0_00}
  - {pin_num: H10, peripheral: PWM2, signal: 'B, 3', pin_signal: GPIO_AD_B0_01}
  - {pin_num: E1, peripheral: PWM3, signal: 'A, 0', pin_signal: GPIO_EMC_29}
  - {pin_num: C6, peripheral: PWM3, signal: 'B, 0', pin_signal: GPIO_EMC_30}
  - {pin_num: C5, peripheral: PWM3, signal: 'A, 1', pin_signal: GPIO_EMC_31}
  - {pin_num: D5, peripheral: PWM3, signal: 'B, 1', pin_signal: GPIO_EMC_32}
  - {pin_num: C4, peripheral: PWM3, signal: 'A, 2', pin_signal: GPIO_EMC_33}
  - {pin_num: D4, peripheral: PWM3, signal: 'B, 2', pin_signal: GPIO_EMC_34}
  - {pin_num: E3, peripheral: PWM4, signal: 'A, 0', pin_signal: GPIO_EMC_00}
  - {pin_num: F3, peripheral: PWM4, signal: 'B, 0', pin_signal: GPIO_EMC_01}
  - {pin_num: F4, peripheral: PWM4, signal: 'A, 1', pin_signal: GPIO_EMC_02}
  - {pin_num: G4, peripheral: PWM4, signal: 'B, 1', pin_signal: GPIO_EMC_03}
  - {pin_num: F2, peripheral: PWM4, signal: 'A, 2', pin_signal: GPIO_EMC_04}
  - {pin_num: G5, peripheral: PWM4, signal: 'B, 2', pin_signal: GPIO_EMC_05}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPwmPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPwmPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03u */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_00_FLEXPWM2_PWMA03,   /* GPIO_AD_B0_00 is configured as FLEXPWM2_PWMA03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_B0_01_FLEXPWM2_PWMB03,   /* GPIO_AD_B0_01 is configured as FLEXPWM2_PWMB03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_00_FLEXPWM4_PWMA00,     /* GPIO_EMC_00 is configured as FLEXPWM4_PWMA00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_01_FLEXPWM4_PWMB00,     /* GPIO_EMC_01 is configured as FLEXPWM4_PWMB00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_02_FLEXPWM4_PWMA01,     /* GPIO_EMC_02 is configured as FLEXPWM4_PWMA01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_03_FLEXPWM4_PWMB01,     /* GPIO_EMC_03 is configured as FLEXPWM4_PWMB01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_04_FLEXPWM4_PWMA02,     /* GPIO_EMC_04 is configured as FLEXPWM4_PWMA02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_05_FLEXPWM4_PWMB02,     /* GPIO_EMC_05 is configured as FLEXPWM4_PWMB02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_06_FLEXPWM2_PWMA00,     /* GPIO_EMC_06 is configured as FLEXPWM2_PWMA00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_07_FLEXPWM2_PWMB00,     /* GPIO_EMC_07 is configured as FLEXPWM2_PWMB00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_08_FLEXPWM2_PWMA01,     /* GPIO_EMC_08 is configured as FLEXPWM2_PWMA01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_09_FLEXPWM2_PWMB01,     /* GPIO_EMC_09 is configured as FLEXPWM2_PWMB01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_23_FLEXPWM1_PWMA00,     /* GPIO_EMC_23 is configured as FLEXPWM1_PWMA00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_24_FLEXPWM1_PWMB00,     /* GPIO_EMC_24 is configured as FLEXPWM1_PWMB00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_25_FLEXPWM1_PWMA01,     /* GPIO_EMC_25 is configured as FLEXPWM1_PWMA01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_26_FLEXPWM1_PWMB01,     /* GPIO_EMC_26 is configured as FLEXPWM1_PWMB01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_27_FLEXPWM1_PWMA02,     /* GPIO_EMC_27 is configured as FLEXPWM1_PWMA02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_28_FLEXPWM1_PWMB02,     /* GPIO_EMC_28 is configured as FLEXPWM1_PWMB02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_29_FLEXPWM3_PWMA00,     /* GPIO_EMC_29 is configured as FLEXPWM3_PWMA00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_30_FLEXPWM3_PWMB00,     /* GPIO_EMC_30 is configured as FLEXPWM3_PWMB00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_31_FLEXPWM3_PWMA01,     /* GPIO_EMC_31 is configured as FLEXPWM3_PWMA01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_32_FLEXPWM3_PWMB01,     /* GPIO_EMC_32 is configured as FLEXPWM3_PWMB01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_33_FLEXPWM3_PWMA02,     /* GPIO_EMC_33 is configured as FLEXPWM3_PWMA02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_34_FLEXPWM3_PWMB02,     /* GPIO_EMC_34 is configured as FLEXPWM3_PWMB02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}


